//Задача 11
//Необходимо вывести на экран числа от -100 до -20. В порядке убывания (от большего к меньшему). Массивом пользоваться нельзя.

package com.aks.sandbox.cases.case7;

public class NumsMinusHundredToMinusTewntyReverse {

    public static void main(String[] args) {

        for (int i = -20; i >= -100; i--) {
            System.out.println(i);
        }

    }

}
