//Задача 10
//Необходимо вывести на экран числа от -100 до -20. Массивом пользоваться нельзя.

package com.aks.sandbox.cases.case7;

public class NumsMinusHundredToMinusTewnty {

    public static void main(String[] args) {

        for (int i = -100; i <= -20; i++) {
            System.out.println(i);
        }

    }

}
